package Algorithms.c.sorting.d.merge.sorting;

/**
 * Сортировка слиянием(тут необходима рекурсия!!!) (работает за n*log2n)
 * Для сортировки слиянием нам необходима реализация алгоритма слияние 2ух отсортированных массивов(смотри класс MergeSorting)
 * принцип работы сортировки слиянием:
 * берем массив и делим его пополам
 * отдельно сортируем правую и левую часть
 * 2 отсортированные половины соединяем вместе
 *
 * необходима рекурсия т.к. мы будем делить массив на 2 части до того момента, пока сортировка вообще не нужна будет(тоесть мыссивы не будут состоять их 2ух элементов)
 */
public class MergeSotring {
}
